# Task1
print('Hello word')

# Task2
print('*' * 5)

# Task3
n = 5
for i in range(n):
    print("#  " * n)

# n = 5    # "Это я попробовала вывести пустой квадрат
# print("* " * n)
# print("* " + ' ' * (n) + ' *')
# print("* " + ' ' * (n) + ' *')
# print("* " * n)

# n = 5    # "Это я попробовала вывести пустой квадрат без пробелов и вопрос правильно ли я сделал что пробелы поставила, потому что иначе прямоугольник получается, или есть другой способ может и подход неправильный
# print("*" * n)
# print("*" + ' ' * (n-2) + '*')
# print("*" + ' ' * (n-2) + '*')
# print("*" * n)

